# Semana 2 - Acelera Dev

# Manipulando Dados

In [1]:
#Importando pacotes
import pandas as pd
import numpy as np

In [2]:
#Acessando Help(documentação dos pacotes)
pd?

Type:        module
String form: <module 'pandas' from '/home/valeria.silva/anaconda3/lib/python3.7/site-packages/pandas/__init__.py'>
File:        ~/anaconda3/lib/python3.7/site-packages/pandas/__init__.py
Docstring:
pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

# Dicionários

In [3]:
#Criando Dicionários (nossos dados)
dados = {'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos' : [100, 200, 300, 400, 500],
        'site' : ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas' : [1000.52, 1052.34, 2002, 5000, 300]}

In [4]:
#Printar Dicionario
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
#Verificando o typo do objeto(dados) criado
type(dados)

dict

In [6]:
#Acesso as chaves do dicionario
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [7]:
#Acessando uma chave especifica
dados['canal_venda']

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [8]:
#Acessando uma posição específica de uma chave
dados['canal_venda'][2]

'instagram'

In [9]:
#Acessando partes específicas dos dados 
dados['canal_venda'][:2]

['facebook', 'twitter']

# Listas

In [10]:
type([1,2,3])

list

In [11]:
#Criando uma lista
lista = [200, 200, 300, 800, 200]

In [12]:
#Printando uma lista
lista

[200, 200, 300, 800, 200]

In [13]:
#Retornando algum objeto da lista
lista[1]

200

In [14]:
#Fatias específicas de uma lista
lista[:2]

[200, 200]

In [15]:
#Adicionando uma lista a um dicionário
dados['lista'] = lista

In [16]:
#Dicionário com a lista inserida
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

# DataFrames

In [17]:
#Criando um DataFrame a partir de um dict (Com pandas(pd))
dataframe = pd.DataFrame(dados)

In [18]:
# Acessando o DataFrame
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [19]:
#Printar os primeiros casos do DataFrame
dataframe.head(1)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200

In [20]:
#Verificando o formato do DataFrame (dataframe=QUALQUERNOME)
dataframe.shape

(5, 5)

In [21]:
#Verificando os índices do DataFrame
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
#Verificando os tipos de dados do DataFrame
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [23]:
#Verificando os tipos dos Dados do DataFrame de acordo com o número de colunas
dataframe.dtypes.value_counts()

int64      2
object     2
float64    1
dtype: int64

In [24]:
#Verificando se existem valores faltantes (nulos) -> isna(Pandas)
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [25]:
#Soma de dados faltantes
dataframe.isna().sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
dtype: int64

In [26]:
#Printando os nomes das colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [27]:
#Acessando uma coluna específica
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [28]:
#Transformando valores de uuma coluna do dataframe para uma lista
list(dataframe['canal_venda'])

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [29]:
#Criando uma nova coluna
dataframe['nova_coluna'] = [1,2,3,4,5]

In [30]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [31]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [32]:
#Removendo uma coluna do DataFrame (inplace=True remove a coluna PERMANENTEMENTE )
dataframe.drop(columns = 'nova_coluna', inplace=True)

In [33]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [34]:
#Removendo várias colunas
dataframe.drop(columns = ['acessos', 'site'])

  canal_venda   vendas  lista
0    facebook  1000.52    200
1     twitter  1052.34    200
2   instagram  2002.00    300
3    linkedin  5000.00    800
4    facebook   300.00    200

In [35]:
#Sem o inplace=True as colunas são removidas apenas naquele instante
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [36]:
#Mostrando as colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [37]:
#Acessando valores específicos de uma coluna
dataframe['canal_venda'][2]

'instagram'

In [38]:
#Acessando fatia de uma coluna
dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [39]:
#Fatiando os dados usando o iloc (linas|colunas)
dataframe.iloc[:1,2:]

    site   vendas  lista
0  site1  1000.52    200

In [40]:
#Fatiar os dados usando índice
dataframe.loc[:3]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800

In [41]:
#Selecionando colunas específicas (como uma lista)
dataframe[['canal_venda', 'vendas']]

  canal_venda   vendas
0    facebook  1000.52
1     twitter  1052.34
2   instagram  2002.00
3    linkedin  5000.00
4    facebook   300.00

In [42]:
#Passando os valores do DataFrame através de Listas
filtro = ['canal_venda', 'vendas']

In [43]:
dataframe[filtro]

  canal_venda   vendas
0    facebook  1000.52
1     twitter  1052.34
2   instagram  2002.00
3    linkedin  5000.00
4    facebook   300.00

In [44]:
#Usando o método info
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

In [45]:
#Pivotando os dados
dataframe.pivot(index='canal_venda', columns='site', values='acessos')

site         site1  site2  site3
canal_venda
facebook     100.0    NaN  500.0
instagram      NaN  300.0    NaN
linkedin       NaN  400.0    NaN
twitter      200.0    NaN    NaN

In [46]:
aux = dataframe.pivot(index='canal_venda', columns='site', values='acessos')

In [47]:
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   site1   2 non-null      float64
 1   site2   2 non-null      float64
 2   site3   1 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [48]:
#Completando os valores faltantes usando fillna(Preenchendo valores nulos)
aux = dataframe.pivot(index='canal_venda', columns='site', values='acessos').fillna(0)
dataframe.pivot(index='canal_venda', columns='site', values='acessos').fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [49]:
#Mudando as colunas usando o melt(Oposto de pivot)
#Melt: bom para agrupamente de colunas
#Melt: achatar, agrupar verticalmente. Importante na redução do nº de linhas
dataframe.melt(id_vars='site', value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

In [50]:
#Resetando o índice do DataFrame
print(aux.columns)
aux = dataframe.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['index', 'canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [51]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [52]:
aux.reset_index()

   level_0  index canal_venda  acessos   site   vendas  lista
0        0      0    facebook      100  site1  1000.52    200
1        1      1     twitter      200  site1  1052.34    200
2        2      2   instagram      300  site2  2002.00    300
3        3      3    linkedin      400  site2  5000.00    800
4        4      4    facebook      500  site3   300.00    200

In [53]:
aux

   index canal_venda  acessos   site   vendas  lista
0      0    facebook      100  site1  1000.52    200
1      1     twitter      200  site1  1052.34    200
2      2   instagram      300  site2  2002.00    300
3      3    linkedin      400  site2  5000.00    800
4      4    facebook      500  site3   300.00    200

In [54]:
#Exemplo do comando melt
aux.melt(id_vars='canal_venda', value_vars =['site'])

  canal_venda variable  value
0    facebook     site  site1
1     twitter     site  site1
2   instagram     site  site2
3    linkedin     site  site2
4    facebook     site  site3

In [55]:
#Somando as colunas do dataframe
dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                          site1site1site2site2site3
vendas                                          9354.86
lista                                              1700
dtype: object

In [56]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [57]:
#Somando as linhas do dataframe
dataframe.sum(axis=1)

0    1300.52
1    1452.34
2    2602.00
3    6200.00
4    1000.00
dtype: float64

In [58]:
#Calculando a mediana das colunas numéricas
print('Por linha: ',dataframe.median(axis= 1) )
print('Por coluna: ', dataframe.median())

Por linha:  0    200.0
1    200.0
2    300.0
3    800.0
4    300.0
dtype: float64
Por coluna:  acessos     300.00
vendas     1052.34
lista       200.00
dtype: float64

In [59]:
#Calculando a média das colunas numéricas
dataframe.mean()

acessos     300.000
vendas     1870.972
lista       340.000
dtype: float64

In [60]:
#Calculando o desvio padrãp das colunas numéricas
dataframe.std()

acessos     158.113883
vendas     1850.931024
lista       260.768096
dtype: float64

In [61]:
#Usando o comando describe que calcula a estatística descritiva
dataframe.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  340.000000
std    158.113883  1850.931024  260.768096
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  200.000000
75%    400.000000  2002.000000  300.000000
max    500.000000  5000.000000  800.000000

In [62]:
#Calculando a moda
dataframe.mode()

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1   300.00  200.0
1         NaN      200  site2  1000.52    NaN
2         NaN      300    NaN  1052.34    NaN
3         NaN      400    NaN  2002.00    NaN
4         NaN      500    NaN  5000.00    NaN

In [63]:
#Valor máximo por coluna
dataframe.max()

canal_venda    twitter
acessos            500
site             site3
vendas          5000.0
lista              800
dtype: object

In [64]:
#Valor mínimo por coluna
dataframe.min()

canal_venda    facebook
acessos             100
site              site1
vendas            300.0
lista               200
dtype: object

Importante ao se trabalhar com dados categóricos ter a dimensão do número de valores únicos.
Uma coluna com um único valor único não me agrega pois não possui variabilidade

In [65]:
#Printando os valores unicos
dataframe.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
dtype: int64

Counts: Muito útil em problemas de categorização

In [66]:
#Contando os valores únicos de uma coluna
dataframe['canal_venda'].value_counts()

facebook     2
twitter      1
linkedin     1
instagram    1
Name: canal_venda, dtype: int64

In [67]:
#Valores únicos de uma coluna
dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [68]:
#Usando o groupby com valores numericos
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [69]:
#Usando  o groupby com valores numéricos
dataframe.groupby('canal_venda')['acessos'].median()

canal_venda
facebook     300
instagram    300
linkedin     400
twitter      200
Name: acessos, dtype: int64

In [70]:
#Usando o groupby com valores categóricos
dataframe.groupby('site')['canal_venda'].unique()

site
site1      [facebook, twitter]
site2    [instagram, linkedin]
site3               [facebook]
Name: canal_venda, dtype: object

In [71]:
#Usando o groupby com valores categóricos
dataframe.groupby('site')['canal_venda'].first()

site
site1     facebook
site2    instagram
site3     facebook
Name: canal_venda, dtype: object

In [72]:
#Usando groupby com a função aff
dataframe.groupby('canal_venda').agg({'site': 'unique', 
                                      'acessos': 'sum'})

                       site  acessos
canal_venda
facebook     [site1, site3]      600
instagram           [site2]      300
linkedin            [site2]      400
twitter             [site1]      200

In [73]:
#Correlação entre variáveis
dataframe.corr(method = 'spearman')

         acessos    vendas     lista
acessos  1.00000  0.000000  0.335410
vendas   0.00000  1.000000  0.894427
lista    0.33541  0.894427  1.000000

In [74]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [75]:
#Criando variáveis categóricas por fatia de variavel numérica
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                       bins= (0, 1500, 2000, 8000), 
                                       labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))

In [76]:
dataframe

  canal_venda  acessos   site   vendas  lista categoria_vendas
0    facebook      100  site1  1000.52    200         0 a 1500
1     twitter      200  site1  1052.34    200         0 a 1500
2   instagram      300  site2  2002.00    300      2000 a 8000
3    linkedin      400  site2  5000.00    800      2000 a 8000
4    facebook      500  site3   300.00    200         0 a 1500

In [77]:
#Criando variavel categorica usando compressao de lista
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [78]:
dataframe

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

**Juntando 2 DataFrames

In [79]:
#Criando o dataframe2
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2' ,'site3'], 'suporte' : ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']
                           })

In [80]:
#REalizando o merge
dataframe.merge(dataframe_2, on ='site', how = 'left')

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
2,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
3,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
4,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
5,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
6,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
7,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
8,facebook,500,site3,300.00,200,0 a 1500,maior_que_300,Ezequiel

In [81]:
#Salvando o dataframe como csv
dataframe.to_csv('data/dataframe.csv', sep = ';', decimal = ',', index = False)

In [82]:
#Lendo dados no formato csv
dataframe_lido = pd.read_csv('data/dataframe.csv', sep = ';', decimal = ',')

In [83]:
dataframe_lido.head()

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300